In [1]:
# import packages
import numpy as np
import pandas as pd
from numpy.random import rand

In [2]:
# Related data objects

# List 
L = [2, 3, 5, 7, 9, 11] 

# Dictionary
D = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} 

# Structured array
SA = np.array([('Rex', 9, 81.0), ('Fido', 3, 27.0), ('Alice', 25, 55.0), ('Bob', 45, 85.5),
              ('Cathy', 37, 68.0), ('Doug', 19, 61.5)],
             dtype=[('name', 'U10'), ('age', 'i4'), ('weight', 'f4')]) 

# Two-dsimensional NumPy array
rand = np.random.RandomState(42)
TDA = rand.randint(20,100,(4,2)) 

# NumPy array
ND = np.array([[21],
[23],
[24],
[21]])


# Series
PS = pd.Series([59, 35, 69, 23], index=["a", "b", "c", "d"])

# Q1: Contrcuting pandas dataframe objects from a list
  ##  a. print list L 
  ##  b. transfer list L to pandas series SL

In [3]:
# a.
L = [2, 3, 5, 7, 9, 11] # List 
print(L)
print(type(L))

[2, 3, 5, 7, 9, 11]
<class 'list'>

In [5]:
# b.

SL = pd.Series(L)
print(SL)
print(type(SL))

0     2
1     3
2     5
3     7
4     9
5    11
dtype: int64
<class 'pandas.core.series.Series'>

# Q2: Constructing pandas dataframe objects from a dictionary
## a. print dictionary D
## b. transfer dictionary D to pandas series SD
## c. add new data {"California": "45000"} to SD
## d. print a pandas series by selecting entries from "Ohio" to "Oregon"

In [6]:
# a.
D = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000} # Dictionary
print(D)

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [9]:
# b.

SD = pd.Series(D)
print(SD)
print(type(SD))

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
# c.

SD['California']=45000
print(SD)

Ohio          35000
Texas         71000
Oregon        16000
Utah           5000
California    45000
dtype: int64

In [13]:
# d.

print(SD['Ohio':'Oregon'])

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

# Q3: Constructing pandas dataframe objects from a numpy structured array
## a. print SA
## b. transfer numpy structured array SA to pandas dataframe DF

In [16]:
# a
SA = np.array([('Rex', 9, 81.0), ('Fido', 3, 27.0), ('Alice', 25, 55.0), ('Bob', 45, 85.5),
              ('Cathy', 37, 68.0), ('Doug', 19, 61.5)],
             dtype=[('name', 'U10'), ('age', 'i4'), ('weight', 'f4')])

print(SA)

[('Rex',  9, 81. ) ('Fido',  3, 27. ) ('Alice', 25, 55. )
 ('Bob', 45, 85.5) ('Cathy', 37, 68. ) ('Doug', 19, 61.5)]

In [17]:
# b
DF = pd.DataFrame(SA)
print(DF)

    name  age  weight
0    Rex    9    81.0
1   Fido    3    27.0
2  Alice   25    55.0
3    Bob   45    85.5
4  Cathy   37    68.0
5   Doug   19    61.5

# Q4: Constructing pandas dataframe objects from a two-dimensional numpy array
## a. print TDA
## b. transfer numpy array TDA to pandas dataframe df2, and
## i. set column name as "foo" and "bar"
## ii. set index as ["a", "b", "c", "d"]
## c. append new column ND to df2, and set column name as "age"

In [18]:
# a.

rand = np.random.RandomState(42)
TDA = rand.randint(20,100,(4,2))
print(TDA)
print(type(TDA))

[[71 34]
 [91 80]
 [40 94]
 [94 43]]
<class 'numpy.ndarray'>

In [40]:
# b.

df2 = pd.DataFrame(TDA)
print(df2)

    0   1
0  71  34
1  91  80
2  40  94
3  94  43

In [20]:
# b. i. ii.

df2 = pd.DataFrame(TDA, 
                   columns=['foo', 'bar'],
                  index=['a', 'b', 'c', 'd'])
print(df2)

   foo  bar
a   71   34
b   91   80
c   40   94
d   94   43

In [23]:
ND = np.array([[21],
[23],
[24],
[21]])

print(ND)

[[21]
 [23]
 [24]
 [21]]

In [22]:
# c. 

df2['age']=ND
print(df2)

   foo  bar  age
a   71   34   21
b   91   80   23
c   40   94   24
d   94   43   21

# Q5: Select data by index in pandas series
## a. print PS
## b. select the data in PS by index "a" to "b"
## c. select the data in PS by 2 to 3 rows
## d. select the data in PS by fancy index "a" and "c"
## e. select the data in PS by the mask (E1 > 30) & (E1 < 60)

In [24]:
# a.

PS = pd.Series([59, 35, 69, 23], index=["a", "b", "c", "d"])
print(PS)

a    59
b    35
c    69
d    23
dtype: int64

In [26]:
# b.

print(PS['a':'b'])

a    59
b    35
dtype: int64

In [30]:
# c.
print(PS[2:4])

c    69
d    23
dtype: int64

In [64]:
# d. 

print(PS[['a', 'c']])

a    59
c    69
dtype: int64

In [33]:
# e. 

PS[(PS>30)&(PS<60)]

a    59
b    35
dtype: int64

# Q6: Index as ordered set
## a. create pandas index object IO1, ["a", "b", "c", "d"]
## b. create pandas index object IO2, ["a", "c", "e", "g"]
## c. find the intersection of IO1 and IO2
## d. find the union of IO1 and IO2
## e. find the symmetric difference of IO1 and IO2

In [37]:
# a.

IO1 =  pd.Index(['a', 'b', 'c', 'd'])
print(IO1)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [38]:
# b.

IO2 = pd.Index(['a', 'c', 'e', 'g'])
print(IO2)

Index(['a', 'c', 'e', 'g'], dtype='object')

In [40]:
# c.

print(IO1.intersection(IO2))

Index(['a', 'c'], dtype='object')

In [41]:
# d.

print(IO1.union(IO2))

Index(['a', 'b', 'c', 'd', 'e', 'g'], dtype='object')

In [43]:
# e.

print(IO1.symmetric_difference(IO2))

Index(['b', 'd', 'e', 'g'], dtype='object')

# Q7: Indexers: loc and iloc
## a. print df2
## b. select the data in "a" row and "foo" column from df2 by loc
## c. select the data in "a" to "b" rows and "foo" to "bar" columns from df2 by loc
## d. select the data in 0 row and 0 column from df2 by iloc
## e. select the data in 0 to 1 rows and 0 to 1 columns from df2 by iloc
## f. select the data in "a" and "c" rows and "foo" and "age" columns from df2 by iloc or loc

In [45]:
# a.

print(df2)

   foo  bar  age
a   71   34   21
b   91   80   23
c   40   94   24
d   94   43   21

In [50]:
# b.

print(df2['foo']['a'])

71

In [54]:
# c.

df2.loc[:'bar', :'b']

   foo  bar
a   71   34
b   91   80

In [57]:
# d.

print(df2.iloc[0,0])

71

In [59]:
# e.

df2.iloc[:2, :2]

   foo  bar
a   71   34
b   91   80

In [61]:
# f.

df2.loc[['a', 'c'],['foo', 'age']]

   foo  age
a   71   21
c   40   24

# Q8: DataFrame as two-dimensional array
## a. combine below two pandas series, "area" and "population" into pandas DataFrame df3
## b. create new column "density" by "population/area"
## c. swap rows and columns
## d. select columns "population" and "density", where "density"<100

In [62]:
area = pd.Series({'California': 423967, 
             'Texas': 695662, 
             'New York': 141297,
             'Florida': 170312, 
             'Illinois': 149995})

In [63]:
population = pd.Series({'California': 38332521,
                    'Texas': 26448193,
                    'New York': 19651127,
                    'Florida': 19552860,
                    'Illinois': 12882135})

In [66]:
# a. 

df3 = pd.DataFrame({'area':area,
                   'population':population})

print(df3)

              area  population
California  423967    38332521
Texas       695662    26448193
New York    141297    19651127
Florida     170312    19552860
Illinois    149995    12882135

In [68]:
# b.

df3['density']=df3['population']/df3['area']

print(df3)

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
New York    141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

In [71]:
# c.
# use transpose to swap rows and columns

df3.transpose()

,California,Texas,New York,Florida,Illinois
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
population,3.833252e+07,2.644819e+07,1.965113e+07,1.955286e+07,1.288214e+07
density,9.041393e+01,3.801874e+01,1.390767e+02,1.148061e+02,8.588376e+01

In [72]:
df3

              area  population     density
California  423967    38332521   90.413926
Texas       695662    26448193   38.018740
New York    141297    19651127  139.076746
Florida     170312    19552860  114.806121
Illinois    149995    12882135   85.883763

In [74]:
# d.

df3.loc[df3.density<100, ['population', 'density']]

            population    density
California    38332521  90.413926
Texas         26448193  38.018740
Illinois      12882135  85.883763

# Q9: Index Alignment in Series
## a. add IS1 and IS2
## b. add IS1 and IS2, fill 0 if any elements in A or B are missing

In [75]:
# run before you answer

IS1 = pd.Series([2, 4, 6, 8,10], index=[0, 1, 2, 3, 4])
IS2 = pd.Series([1, 3, 5, 7,9], index=[1, 2, 3, 4, 5])

In [77]:
# a.

print(IS1+IS2)

0     NaN
1     5.0
2     9.0
3    13.0
4    17.0
5     NaN
dtype: float64

In [81]:
# b.
print(IS1.add(IS2, fill_value=0))

0     2.0
1     5.0
2     9.0
3    13.0
4    17.0
5     9.0
dtype: float64

# Q10: Index Alignment in DataFrame
## a. add IS3 and IS4
## b. add IS3 and IS4, fill mean value of IS3 or IS4 DataFrame if any elements in A or B are missing respectively.

In [82]:
IS3 = pd.DataFrame([[1, 2],[3, 4]], columns=list('AB'))
IS4 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], columns=list('BAC'))

In [83]:
print(IS3)
print(IS4)

   A  B
0  1  2
1  3  4
   B  A  C
0  1  2  3
1  4  5  6
2  7  8  9

In [85]:
# a. 

IS3+IS4

     A    B   C
0  3.0  3.0 NaN
1  8.0  8.0 NaN
2  NaN  NaN NaN

In [89]:
IS3.stack().mean()

2.5

In [88]:
# b.

fill=IS3.stack().mean()
IS3.add(IS4, fill_value=fill)

      A    B     C
0   3.0  3.0   5.5
1   8.0  8.0   8.5
2  10.5  9.5  11.5